/**
 * 《编程语言实现模式》模式4：LL(k)递归下降的语法解析器
 * 目的：使用k(k>1)个向前看词法单元来分析词法单元流的语法结构
 * 
 * 使用有限缓冲构造环形向前看缓冲区:
 * 
 * 缓冲区大小为k, index为p,每一次访问p处内容后，
 *  缓冲区的p下标处将存未访问的第一个字符，
 *  然后 p = (p+1)%k
 *  例如： k为3， 访问语句为[a, b = c], 初始化p = 0
 *  -------------       -------------        -------------   
 *  | [ | b | , |  -->  | b | a | , |  --->  | b | = | , |
 *  -------------       -------------        -------------
 *    ^                       ^                        ^      
 *    |                       |                        |
 *  p = 0                   p = 1                    p = 2
 *    
 *   -------------           ------------- 
 *   | b | = | c |    --->   | ] | = | c |
 *   -------------           -------------
 *     ^                           ^
 *     |                           |
 *   p = (2+1)%3 = 0             p = 1   
 *    
 *    
 *    
 *    
 * 
 */
/**
 * @author vincent
 *
 */
package com.vincent.pattern4;